class OperatorDemo2 {
	public static void main(String[] args) {
		int a = 3;
		int b = 4;
	
		System.out.println(3&4);
		System.out.println(3|4);
		System.out.println(3^4);
		System.out.println(~3);
		/*
		3&4：
		0000000 0000000 0000000 00000011
		0000000 0000000 0000000 00000100
		0000000 0000000 0000000 00000000  输出为0
		~3：
		0000000 0000000 0000000 00000011
		1111111 1111111 1111111 11111100  这是补码
		1111111 1111111 1111111 11111011  这是反码
		1000000 0000000 0000000 00000100  这是原码
		输出为-4
		*/
		}
}